# ~/dotfiles/Brewfile

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Core utilities / version managers
brew "pyenv"            # Python version manager
brew "nvm"              # Node version manager
brew "k9s"              # Kubernetes CLI UI
brew "neovim"           # Neovim editor
brew "kubectl"
brew "docker"           # Docker CLI (Docker Desktop can be installed via cask)
brew "git"              # Git (if you want to override system Git)

# GUI apps
cask "docker"           # Docker Desktop
cask "ghostty"          # Ghostty terminal emulator
cask "postman"
cask "rectangle"        # Free window manager on macOS
cask "maccy"            # Free clipboard manager on macOS
cask "the-unarchiver"
cask "visual-studio-code" # VSCode

# Fonts
cask "font-meslo-lg-nerd-font" # Powerlevel10k recommended font

# (Optional: any other tools you like, e.g.: jq, wget, etc.)
brew "jq"
brew "htop"